fspiop-quotes/20231005/s4-1696546237009/logs/load-k6-1.log
Attaching to load-k6-1
load-k6-1  | 
load-k6-1  |           /\      |‾‾| /‾‾/   /‾‾/   
load-k6-1  |      /\  /  \     |  |/  /   /  /    
load-k6-1  |     /  \/    \    |     (   /   ‾‾\  
load-k6-1  |    /          \   |  |\  \ |  (‾)  | 
load-k6-1  |   / __________ \  |__| \__\ \_____/ .io
load-k6-1  | 
load-k6-1  | 
load-k6-1  |   execution: local
load-k6-1  |      script: /scripts/index.js
load-k6-1  |      output: Prometheus remote write (http://prometheus:9090/api/v1/write)
load-k6-1  | 
load-k6-1  |   scenarios: (100.00%) 1 scenario, 1 max VUs, 2m30s max duration (incl. graceful stop):
load-k6-1  |            * fspiopQuotes: Up to 1 looping VUs for 2m0s over 2 stages (gracefulRampDown: 30s, exec: fspiopQuotesScenarios, gracefulStop: 30s)
load-k6-1  | 
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m01.0s), 1/1 VUs, 46 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   1% ] 1/1 VUs  0m01.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m02.0s), 1/1 VUs, 107 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   2% ] 1/1 VUs  0m02.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m03.0s), 1/1 VUs, 175 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   2% ] 1/1 VUs  0m03.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m04.0s), 1/1 VUs, 245 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   3% ] 1/1 VUs  0m04.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m05.0s), 1/1 VUs, 317 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   4% ] 1/1 VUs  0m05.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m06.0s), 1/1 VUs, 384 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   5% ] 1/1 VUs  0m06.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m07.0s), 1/1 VUs, 458 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   6% ] 1/1 VUs  0m07.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m08.0s), 1/1 VUs, 532 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   7% ] 1/1 VUs  0m08.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m09.0s), 1/1 VUs, 606 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   7% ] 1/1 VUs  0m09.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m10.0s), 1/1 VUs, 682 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   8% ] 1/1 VUs  0m10.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m11.0s), 1/1 VUs, 757 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [   9% ] 1/1 VUs  0m11.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m12.0s), 1/1 VUs, 830 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  10% ] 1/1 VUs  0m12.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m13.0s), 1/1 VUs, 906 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  11% ] 1/1 VUs  0m13.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m14.0s), 1/1 VUs, 978 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  12% ] 1/1 VUs  0m14.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m15.0s), 1/1 VUs, 1058 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  12% ] 1/1 VUs  0m15.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m16.0s), 1/1 VUs, 1137 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  13% ] 1/1 VUs  0m16.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m17.0s), 1/1 VUs, 1215 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  14% ] 1/1 VUs  0m17.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m18.0s), 1/1 VUs, 1295 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  15% ] 1/1 VUs  0m18.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m19.0s), 1/1 VUs, 1374 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  16% ] 1/1 VUs  0m19.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m20.0s), 1/1 VUs, 1450 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  17% ] 1/1 VUs  0m20.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m21.0s), 1/1 VUs, 1526 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  17% ] 1/1 VUs  0m21.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m22.0s), 1/1 VUs, 1602 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  18% ] 1/1 VUs  0m22.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m23.0s), 1/1 VUs, 1676 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  19% ] 1/1 VUs  0m23.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m24.0s), 1/1 VUs, 1753 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  20% ] 1/1 VUs  0m24.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m25.0s), 1/1 VUs, 1830 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  21% ] 1/1 VUs  0m25.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m26.0s), 1/1 VUs, 1908 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  22% ] 1/1 VUs  0m26.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m27.0s), 1/1 VUs, 1988 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  22% ] 1/1 VUs  0m27.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m28.0s), 1/1 VUs, 2072 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  23% ] 1/1 VUs  0m28.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m29.0s), 1/1 VUs, 2152 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  24% ] 1/1 VUs  0m29.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m30.0s), 1/1 VUs, 2236 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  25% ] 1/1 VUs  0m30.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m31.0s), 1/1 VUs, 2321 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  26% ] 1/1 VUs  0m31.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m32.0s), 1/1 VUs, 2402 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  27% ] 1/1 VUs  0m32.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m33.0s), 1/1 VUs, 2484 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  27% ] 1/1 VUs  0m33.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m34.0s), 1/1 VUs, 2565 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  28% ] 1/1 VUs  0m34.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m35.0s), 1/1 VUs, 2644 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  29% ] 1/1 VUs  0m35.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m36.0s), 1/1 VUs, 2725 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  30% ] 1/1 VUs  0m36.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m37.0s), 1/1 VUs, 2807 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  31% ] 1/1 VUs  0m37.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m38.0s), 1/1 VUs, 2886 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  32% ] 1/1 VUs  0m38.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m39.0s), 1/1 VUs, 2966 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  32% ] 1/1 VUs  0m39.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m40.0s), 1/1 VUs, 3045 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  33% ] 1/1 VUs  0m40.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m41.0s), 1/1 VUs, 3123 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  34% ] 1/1 VUs  0m41.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m42.0s), 1/1 VUs, 3203 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  35% ] 1/1 VUs  0m42.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m43.0s), 1/1 VUs, 3286 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  36% ] 1/1 VUs  0m43.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m44.0s), 1/1 VUs, 3369 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  37% ] 1/1 VUs  0m44.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m45.0s), 1/1 VUs, 3455 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  37% ] 1/1 VUs  0m45.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m46.0s), 1/1 VUs, 3541 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  38% ] 1/1 VUs  0m46.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m47.0s), 1/1 VUs, 3623 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  39% ] 1/1 VUs  0m47.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m48.0s), 1/1 VUs, 3701 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  40% ] 1/1 VUs  0m48.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m49.0s), 1/1 VUs, 3781 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  41% ] 1/1 VUs  0m49.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m50.0s), 1/1 VUs, 3863 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  42% ] 1/1 VUs  0m50.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m51.0s), 1/1 VUs, 3943 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  42% ] 1/1 VUs  0m51.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m52.0s), 1/1 VUs, 4019 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  43% ] 1/1 VUs  0m52.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m53.0s), 1/1 VUs, 4094 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  44% ] 1/1 VUs  0m53.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m54.0s), 1/1 VUs, 4169 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  45% ] 1/1 VUs  0m54.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m55.0s), 1/1 VUs, 4247 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  46% ] 1/1 VUs  0m55.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m56.0s), 1/1 VUs, 4324 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  47% ] 1/1 VUs  0m56.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m57.0s), 1/1 VUs, 4401 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  47% ] 1/1 VUs  0m57.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m58.0s), 1/1 VUs, 4478 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  48% ] 1/1 VUs  0m58.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (0m59.0s), 1/1 VUs, 4552 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  49% ] 1/1 VUs  0m59.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m00.0s), 1/1 VUs, 4627 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  50% ] 1/1 VUs  1m00.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m01.0s), 1/1 VUs, 4698 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  51% ] 1/1 VUs  1m01.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m02.0s), 1/1 VUs, 4769 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  52% ] 1/1 VUs  1m02.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m03.0s), 1/1 VUs, 4842 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  52% ] 1/1 VUs  1m03.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m04.0s), 1/1 VUs, 4919 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  53% ] 1/1 VUs  1m04.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m05.0s), 1/1 VUs, 4996 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  54% ] 1/1 VUs  1m05.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m06.0s), 1/1 VUs, 5076 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  55% ] 1/1 VUs  1m06.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m07.0s), 1/1 VUs, 5155 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  56% ] 1/1 VUs  1m07.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m08.0s), 1/1 VUs, 5233 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  57% ] 1/1 VUs  1m08.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m09.0s), 1/1 VUs, 5307 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  57% ] 1/1 VUs  1m09.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m10.0s), 1/1 VUs, 5382 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  58% ] 1/1 VUs  1m10.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m11.0s), 1/1 VUs, 5453 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  59% ] 1/1 VUs  1m11.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m12.0s), 1/1 VUs, 5531 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  60% ] 1/1 VUs  1m12.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m13.0s), 1/1 VUs, 5611 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  61% ] 1/1 VUs  1m13.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m14.0s), 1/1 VUs, 5691 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  62% ] 1/1 VUs  1m14.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m15.0s), 1/1 VUs, 5769 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  62% ] 1/1 VUs  1m15.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m16.0s), 1/1 VUs, 5851 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  63% ] 1/1 VUs  1m16.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m17.0s), 1/1 VUs, 5929 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  64% ] 1/1 VUs  1m17.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m18.0s), 1/1 VUs, 6010 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  65% ] 1/1 VUs  1m18.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m19.0s), 1/1 VUs, 6090 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  66% ] 1/1 VUs  1m19.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m20.0s), 1/1 VUs, 6167 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  67% ] 1/1 VUs  1m20.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m21.0s), 1/1 VUs, 6249 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  67% ] 1/1 VUs  1m21.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m22.0s), 1/1 VUs, 6331 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  68% ] 1/1 VUs  1m22.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m23.0s), 1/1 VUs, 6412 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  69% ] 1/1 VUs  1m23.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m24.0s), 1/1 VUs, 6491 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  70% ] 1/1 VUs  1m24.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m25.0s), 1/1 VUs, 6572 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  71% ] 1/1 VUs  1m25.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m26.0s), 1/1 VUs, 6650 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  72% ] 1/1 VUs  1m26.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m27.0s), 1/1 VUs, 6734 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  72% ] 1/1 VUs  1m27.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m28.0s), 1/1 VUs, 6816 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  73% ] 1/1 VUs  1m28.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m29.0s), 1/1 VUs, 6899 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  74% ] 1/1 VUs  1m29.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m30.0s), 1/1 VUs, 6977 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  75% ] 1/1 VUs  1m30.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m31.0s), 1/1 VUs, 7060 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  76% ] 1/1 VUs  1m31.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m32.0s), 1/1 VUs, 7141 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  77% ] 1/1 VUs  1m32.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m33.0s), 1/1 VUs, 7219 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  77% ] 1/1 VUs  1m33.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m34.0s), 1/1 VUs, 7298 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  78% ] 1/1 VUs  1m34.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m35.0s), 1/1 VUs, 7380 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  79% ] 1/1 VUs  1m35.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m36.0s), 1/1 VUs, 7460 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  80% ] 1/1 VUs  1m36.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m37.0s), 1/1 VUs, 7540 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  81% ] 1/1 VUs  1m37.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m38.0s), 1/1 VUs, 7626 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  82% ] 1/1 VUs  1m38.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m39.0s), 1/1 VUs, 7709 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  82% ] 1/1 VUs  1m39.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m40.0s), 1/1 VUs, 7788 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  83% ] 1/1 VUs  1m40.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m41.0s), 1/1 VUs, 7868 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  84% ] 1/1 VUs  1m41.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m42.0s), 1/1 VUs, 7950 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  85% ] 1/1 VUs  1m42.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m43.0s), 1/1 VUs, 8032 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  86% ] 1/1 VUs  1m43.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m44.0s), 1/1 VUs, 8109 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  87% ] 1/1 VUs  1m44.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m45.0s), 1/1 VUs, 8187 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  87% ] 1/1 VUs  1m45.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m46.0s), 1/1 VUs, 8268 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  88% ] 1/1 VUs  1m46.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m47.0s), 1/1 VUs, 8347 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  89% ] 1/1 VUs  1m47.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m48.0s), 1/1 VUs, 8421 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  90% ] 1/1 VUs  1m48.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m49.0s), 1/1 VUs, 8493 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  91% ] 1/1 VUs  1m49.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m50.0s), 1/1 VUs, 8572 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  92% ] 1/1 VUs  1m50.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m51.0s), 1/1 VUs, 8655 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  92% ] 1/1 VUs  1m51.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m52.0s), 1/1 VUs, 8735 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  93% ] 1/1 VUs  1m52.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m53.0s), 1/1 VUs, 8812 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  94% ] 1/1 VUs  1m53.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m54.0s), 1/1 VUs, 8891 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  95% ] 1/1 VUs  1m54.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m55.0s), 1/1 VUs, 8968 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  96% ] 1/1 VUs  1m55.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m56.0s), 1/1 VUs, 9048 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  97% ] 1/1 VUs  1m56.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m57.0s), 1/1 VUs, 9130 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  97% ] 1/1 VUs  1m57.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m58.0s), 1/1 VUs, 9215 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  98% ] 1/1 VUs  1m58.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (1m59.0s), 1/1 VUs, 9296 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [  99% ] 1/1 VUs  1m59.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (2m00.0s), 1/1 VUs, 9375 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes   [ 100% ] 1/1 VUs  2m00.0s/2m00.0s
load-k6-1  | 
load-k6-1  | 
load-k6-1  |      ✓ QUOTES_FSPIOP_POST_QUOTES_RESPONSE_IS_202
load-k6-1  |      ✓ QUOTES_E2E_FSPIOP_POST_QUOTES_SUCCESS
load-k6-1  | 
load-k6-1  |      █ Post Quotes
load-k6-1  | 
load-k6-1  |      checks.........................: 100.00% ✓ 18752     ✗ 0   
load-k6-1  |      data_received..................: 2.9 MB  25 kB/s
load-k6-1  |      data_sent......................: 11 MB   94 kB/s
load-k6-1  |      group_duration.................: avg=181.55µs min=123.34µs med=181.56µs max=1.07ms   p(90)=209.07µs p(95)=221.63µs
load-k6-1  |      http_req_blocked...............: avg=3.29µs   min=1.44µs   med=3.15µs   max=431.34µs p(90)=4.24µs   p(95)=4.6µs   
load-k6-1  |      http_req_connecting............: avg=16ns     min=0s       med=0s       max=154.17µs p(90)=0s       p(95)=0s      
load-k6-1  |    ✓ http_req_duration..............: avg=1.06ms   min=878.75µs med=1.02ms   max=16.89ms  p(90)=1.18ms   p(95)=1.26ms  
load-k6-1  |        { expected_response:true }...: avg=1.06ms   min=878.75µs med=1.02ms   max=16.89ms  p(90)=1.18ms   p(95)=1.26ms  
load-k6-1  |    ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 9376
load-k6-1  |      http_req_receiving.............: avg=24.67µs  min=12.19µs  med=23.82µs  max=207.04µs p(90)=31.42µs  p(95)=33.83µs 
load-k6-1  |      http_req_sending...............: avg=18.87µs  min=11.51µs  med=18.57µs  max=97.45µs  p(90)=22.42µs  p(95)=23.83µs 
load-k6-1  |      http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
load-k6-1  |      http_req_waiting...............: avg=1.01ms   min=844.48µs med=983.43µs max=16.78ms  p(90)=1.13ms   p(95)=1.22ms  
load-k6-1  |      http_reqs......................: 9376    78.127977/s
load-k6-1  |    ✓ iteration_duration.............: avg=12.78ms  min=10.62ms  med=12.5ms   max=121.17ms p(90)=14.25ms  p(95)=14.97ms 
load-k6-1  |      iterations.....................: 9376    78.127977/s
load-k6-1  |      vus............................: 1       min=1       max=1 
load-k6-1  |      vus_max........................: 1       min=1       max=1 
load-k6-1  |      ws_connecting..................: avg=324.46µs min=213.22µs med=304.79µs max=10.06ms  p(90)=353.1µs  p(95)=373.81µs
load-k6-1  |      ws_msgs_received...............: 9376    78.127977/s
load-k6-1  |      ws_msgs_sent...................: 9376    78.127977/s
load-k6-1  |      ws_session_duration............: avg=12.52ms  min=10.42ms  med=12.23ms  max=120.47ms p(90)=13.98ms  p(95)=14.68ms 
load-k6-1  |      ws_sessions....................: 9376    78.127977/s
load-k6-1  | 
load-k6-1  | 
load-k6-1  | running (2m00.0s), 0/1 VUs, 9376 complete and 0 interrupted iterations
load-k6-1  | fspiopQuotes ✓ [ 100% ] 0/1 VUs  2m0s
load-k6-1  | 
load-k6-1 exited with code 0